# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'findutils'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'hub'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps casks
cask '1password'
cask 'alfred'
cask 'amphetamine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'handbrake'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'moom'
cask 'parallels'
cask 'postman'
cask 'screens'
cask 'screens-connect'
cask 'phpmon'
cask 'ray'
cask 'raycast'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'tuple'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'zwift'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Sequel Ace', id: 1518036000
mas 'Tweetbot', id: 1384080005
# mas 'The Unarchiver', id: 425424353
# mas 'Keynote', id: 409183694
# mas 'Things', id: 904280696
