# Taps
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# cli tools
brew 'ack'                          # Search tool like grep, but optimized for programmers
brew 'atuin'                        # Improved shell history for zsh, bash, fish and nushell
brew 'awscli'                       # Official Amazon AWS command-line interface
brew 'bash'                         # Latest Bash version
brew 'bat'                          # Clone of cat(1) with syntax highlighting and Git integration
brew 'btop'                         # Resource monitor. C++ version and continuation of bashtop and bpytop
brew 'colima'                       # Container runtimes on MacOS (and Linux) with minimal setup
brew 'curl'                         # Get a file from an HTTP, HTTPS or FTP server
brew 'curlie'                       # Power of curl, ease of use of httpie
brew 'docker'                       # Docker CLI
brew 'docker-compose'               # Docker Compose CLI
brew 'docker-credential-helper'     # Docker Credential Helper
brew 'eza'                          # Modern, maintained replacement for ls
brew 'fastfetch'                    # Like neofetch, but much faster because written mostly in C
brew 'fd'                           # Simple, fast and user-friendly alternative to find
brew 'fzf'                          # Command-line fuzzy finder written in Go
brew 'gawk'                         # GNU awk utility
brew 'gh'                           # GitHub command-line tool
brew 'gifsicle'                     # GIF image/animation creator/editor
brew 'git'                          # Distributed revision control system
brew 'git-delta'                    # Syntax-highlighting pager for git and diff output
brew 'git-flow'                     # Extensions to follow Vincent Driessen's branching model
brew 'git-lfs'                      # Git extension for versioning large files
brew 'github-keygen'                # Bootstrap GitHub SSH configuration
brew 'glow'                         # markdown viewer
brew 'gnupg'                        # GNU Pretty Good Privacy (PGP) package
brew 'go-task'                      # Task is a task runner/build tool thats simpler and easier to use
brew 'grex'                         # Command-line tool for generating regular expressions
brew 'htop'                         # Improved top (interactive process viewer)
brew 'httpie'                       # User-friendly cURL replacement (command-line HTTP client)
brew 'jpegoptim'                    # Utility to optimize JPEG files
brew 'jq'                           # Lightweight and flexible command-line JSON processor
brew 'keychain'                     # User-friendly front-end to ssh-agent(1)
brew 'lazydocker'                   # Lazier way to manage everything docker
brew 'lazygit'                      # Simple terminal UI for git commands
brew 'mise'                         # Polyglot runtime manager (asdf rust clone)
brew 'neovim'                       # Ambitious Vim-fork focused on extensibility and agility
brew 'oh-my-posh'                   # Prompt theme engine for any shell
brew 'optipng'                      # PNG file optimizer
brew 'pinentry-mac'                 # Pinentry for GPG on Mac
brew 'pkgconf'                      # Package compiler and linker metadata toolkit
brew 'pngquant'                     # PNG image optimizing utility
brew 'poppler'                      # PDF rendering library (based on the xpdf-3.0 code base)
brew 'procs'                        # Modern replacement for ps written in Rust
brew 'resvg'                        # SVG rendering tool and library
brew 'ripgrep'                      # Search tool like grep and The Silver Searcher
brew 'sevenzip'                     # 7-Zip is a file archiver with a high compression ratio
brew 'stow'                         # Organize software neatly under a single directory tree (e.g. /usr/local)
brew 'svgo'                         # Nodejs-based tool for optimizing SVG vector graphics files
brew 'tlrc'                         # Very fast implementation of tldr in Rust
brew 'thefuck'                      # Programmatically correct mistyped console commands
brew 'tmux'                         # Terminal multiplexer
brew 'tree'                         # Display directories as trees (with optional color/HTML output)
brew 'vim'                          # Vi 'workalike' with many additional features
brew 'wget'                         # Internet file retriever
brew 'xh'                           # Friendly and fast tool for sending HTTP requests
brew 'xz'                           # General-purpose data compression with high compression ratio
brew 'yazi'                         # Blazing fast terminal file manager written in Rust, based on async I/O
brew 'yq'                           # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'zlib'                         # Needed for Memcached
brew 'zoxide'                       # Shell extension to navigate your filesystem faster
brew 'zimfw'                        # Zsh plugin manager
brew 'zsh'                          # UNIX shell (command interpreter)
brew 'zsh-autosuggestions'          # Fish-like fast/unobtrusive autosuggestions for zsh
brew 'zsh-completions'              # Additional completion definitions for zsh
brew 'zsh-fast-syntax-highlighting' # Feature-rich syntax highlighting for Zsh

# Development
brew 'php'                      # php language
brew 'composer'                 # Package Manager for PHP
brew 'imagemagick'              # Tools and libraries to manipulate images in many formats
brew 'shivammathur/php/php@8.3' # php version 8.3
brew 'shivammathur/php/php@8.2' # php version 8.2
brew 'shivammathur/php/php@8.1' # php version 8.1
# php 8.4 exts
brew 'shivammathur/extensions/pcov@8.4'
brew 'shivammathur/extensions/xdebug@8.4'
brew 'shivammathur/extensions/imagick@8.4'
# php 8.3 exts
brew 'shivammathur/extensions/pcov@8.3'
brew 'shivammathur/extensions/xdebug@8.3'
brew 'shivammathur/extensions/imagick@8.3'
# php 8.2 exts
brew 'shivammathur/extensions/pcov@8.2'
brew 'shivammathur/extensions/xdebug@8.2'
brew 'shivammathur/extensions/imagick@8.2'
# php 8.1 exts
brew 'shivammathur/extensions/pcov@8.1'
brew 'shivammathur/extensions/xdebug@8.1'
brew 'shivammathur/extensions/imagick@8.1'

# Agentic AI
brew 'opencode'                # AI coding agent, built for the terminal

if OS.mac?
    # macOS-specific cli tools
    brew 'mas'                 # Mac App Store manager
    brew 'terminal-notifier'   # Send macOS User Notifications from the command-line
    brew 'svn'                 # Needed to install fonts via Homebrew casks

    # GNU tools (macOS needs these, Linux has them by default)
    brew 'coreutils'           # Those that come with macOS are outdated
    brew 'findutils'           # Collection of GNU find, xargs, and locate
    brew 'gnu-sed'             # GNU implementation of the famous stream editor
    brew 'gnu-tar'             # GNU version of the tar archiving utility
    brew 'grep'                # GNU grep, egrep and fgrep

    # Code Editors
    cask 'claude-code'         # Terminal-based AI coding assistant
    cask 'conductor'           # Claude code parallelisation
    cask 'cursor'              # Agentic AI code editor
    cask 'phpstorm'            # PHP IDE by JetBrains
    cask 'visual-studio-code'  # Microsoft Visual Studio Code
    cask 'zed'                 # Agentic code editor

    # Apps casks
    cask '1password'           # 1Password app
    cask '1password-cli'       # Command-line interface for 1Password
    cask 'alt-tab'             # Enable Windows-like alt-tab
    cask 'appcleaner'          # Application uninstaller
    cask 'bartender'           # Menu bar icon organiser
    cask 'betterdisplay'       # Display management tool
    cask 'boop'                # Scriptable scratchpad for developers
    cask 'ghostty'             # Terminal emulator that uses platform-native UI and GPU acceleration
    cask 'github'              # GitHub Desktop
    cask 'google-chrome'       # Google Chrome browser
    cask 'hammerspoon'         # Desktop automation application
    cask 'handbrake-app'       # Open-source video transcoder available for Linux, Mac, and Windows
    cask 'iina'                # Free and open-source media player
    cask 'imagealpha'          # Utility to reduce the size of 24-bit PNG files
    cask 'imageoptim'          # Tool to optimise images to a smaller size
    cask 'istat-menus'         # System monitoring app
    cask 'iterm2'              # Terminal emulator as alternative to Apple's Terminal app
    cask 'jordanbaird-ice'     # Menu bar manager
    cask 'karabiner-elements'  # Keyboard customiser
    cask 'keka'                # the macOS file archiver
    cask 'keycastr'            # Open-source keystroke visualiser
    cask 'latest'              # Utility that shows the latest app updates
    cask 'leader-key'          # Keyboard Application launcher
    cask 'monitorcontrol'      # Tool to control external monitor brightness & volume
    cask 'moom'                # Utility to move and zoom windows—on one display
    cask 'orbstack'            # Replacement for Docker Desktop
    cask 'omnidisksweeper'     # Finds large, unwanted files and deletes them
    cask 'paste'               # Limitless clipboard
    cask 'pika'                # Colour picker for colours onscreen
    cask 'postman'             # Collaboration platform for API development
    cask 'raycast'             # Control your tools with a few keystrokes
    cask 'sequel-ace'          # MySQL/MariaDB database management
    cask 'screens'             # Remote access software focusing on usability
    cask 'slack'               # Team communication and collaboration software
    cask 'subler'              # Mux and tag mp4 files
    cask 'superwhisper'        # Dictation tool including LLM reformatting
    cask 'tableplus'           # Native GUI tool for relational databases
    cask 'tailscale-app'       # Mesh VPN based on WireGuard
    cask 'transmit'            # File transfer application
    cask 'tweakphp/tap/tweakphp' # Desktop application with a code editor to tweak your PHP code
    cask 'utm'                 # Virtual machines UI using QEMU
    cask 'vlc'                 # Multimedia player
    cask 'yaak'                # REST, GraphQL and gRPC client
    cask 'zoom'                # Video communication and virtual meeting platform

    # Fonts
    cask 'font-meslo-lg-nerd-font'
    cask 'font-jetbrains-mono-nerd-font'
    cask 'font-hack-nerd-font'
    cask 'font-symbols-only-nerd-font'

    # Quicklook
    cask 'qlcolorcode'      #
    cask 'qlmarkdown'       # Quick Look generator for Markdown files
    cask 'qlstephen'        #
    cask 'quicklook-json'   # depricated
    cask 'quicklook-csv'    # depricated
    cask 'webpquicklook'    # Quick Look plugin for WebP images
    cask 'qlvideo'          # Thumbnails, static previews, and metadata for video files
end
