# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'shivammathur/php'
tap 'koekeishiya/formulae'

# Binaries
brew 'ack'
brew 'awscli'
brew 'bash'       # Latest Bash version
brew 'bat'        # better cat
brew 'coreutils'  # Those that come with macOS are outdated
brew 'entr'       # Run arbitrary commands when files change
brew 'eza'        # modern replacement for ls
brew 'fd'         # fast and user-friendly alternative to find
brew 'ffmpeg'
brew 'findutils'
brew 'fzf'        # Fuzzy Finder
brew 'gh'
brew 'git'
brew 'git-delta'  # syntax-highlighting pager for git, diff, and grep output
brew 'git-flow'   # git branching model
brew 'gnupg'
brew 'grep'
brew 'hub'
brew 'htop'
brew 'httpie'
brew 'jq'         # json command line processor
brew 'koekeishiya/formulae/skhd'  # Simple hotkey daemon for macOS
brew 'koekeishiya/formulae/yabai' # Tiling window manager
brew 'mas'        # Mac App Store manager
brew 'mc'         # midnight-commander
brew 'neovim'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'rg'         # ripgrep
brew 'stow'       # dotfiles symlink farm manager
brew 'svn'        # Needed to install fonts
brew 'thefuck'    # Corrects your previous console command
brew 'tlrc'       # tldr for man pages
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zlib'       # Needed for Memcached
brew 'zoxide'

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'shivammathur/php/php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'node'

# Apps casks
cask '1password'
cask 'airbuddy'
cask 'alt-tab'
cask 'bartender'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'folx'
cask 'github'
cask 'gitup'
cask 'google-chrome'
cask 'handbrake'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keka'                 # macOS file archiver
cask 'latest'
cask 'monitorcontrol'
cask 'moom'
cask 'obsidian'
cask 'omnidisksweeper'
cask 'postman'
cask 'phpstorm'
cask 'rapidapi'
cask 'rar'
cask 'raycast'
cask 'screens'
cask 'screens-connect'
cask 'sequel-ace'
cask 'slack'
cask 'subler'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
cask 'tunnelblick'
cask 'tuple'
cask 'vidl'
cask 'visual-studio-code'
cask 'vlc'
cask 'xit'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlvideo'

# Fonts
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-lato'
cask 'font-meslo-lg-nerd-font'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'homebrew/cask-fonts/font-source-code-pro'
cask 'font-sf-pro'
cask 'font-sf-pro'
cask 'font-fira-code'
cask 'sf-symbols'

# Mac App Store
# mas '1Blocker - Ad Blocker', id: 1365531024
# mas 'Amphetamine', id: 937984704
# mas 'Boop', id: 1518425043
# mas 'Byword', id: 420212497
# mas 'Coin Tick - Menu Bar Crypto', id: 1141688067
# mas 'Dropzone 4', id: 1485052491
# mas 'Gestimer', id: 990588172
# mas 'Glance - Quick Look Code Files', id: 1564688210
# mas 'HazeOver • Distraction Dimmer', id: 430798174
# mas 'LookUp: English dictionary', id: 872564448
# mas 'Moom', id: 419330170
# mas 'Numbers', id: 409203825
# mas 'Paste - Clipboard Manager', id: 967805235
# mas 'PCalc', id: 403504866
# mas 'Pixave', id: 924891282
# mas 'Pixelmator Pro', id: 1289583905
# mas 'Redacted', id: 984968384
# mas 'Reeder 5.', id: 1529448980
# mas 'Sequel Ace', id: 1518036000
# mas 'Soulver 2', id: 413965349
# mas 'Tailscale', id: 1475387142
# mas 'xScope 4', id: 889428659
# mas 'Yoink - Improved Drag and Drop', id: 457622435
# mas 'The Unarchiver', id: 425424353
# mas 'Keynote', id: 409183694
# mas 'Things', id: 904280696
